const handler = async (m, {conn}) => {
  m.reply(global.terminos);
};
handler.customPrefix = /about/ |/i;
handler.command = new RegExp;
export default handler;

global.terminos = `
*=> عدم المعرفة بما يُذكر هنا لا يُعفي مالك البوت، أو البوت الفرعي، أو مستخدم البوت من العقوبات التي يمكن أن تنتج❗*

*⚠️ شروط الخصوصية*
_1.- لا تتم مشاركة المعلومات التي يتلقاها الروبوت مع أي طرف ثالث أو أي شخص_
_2.- لا تتم مشاركة الصور/مقاطع الفيديو/الملصقات/التسجيلات الصوتية/إلخ مع أي شخص_
_3.- لا تتم مشاركة رقم هاتفك مع أي شخص._
_4.- يتم حذف بيانات البطاقة والمواقع والعناوين وما إلى ذلك على الفور ولا تتم مشاركتها مع أي شخص._
_5.- يتم حذف جميع المحادثات من وقت لآخر ولا يتم عمل نسخة احتياطية (لا يتم حفظها) لأي نوع من المعلومات/المحادثات._

*⚠️ شروط الاستخدام*
 _1.- نحن لسنا مسؤولين عن أي سوء استخدام قد يعطى للبوت_
 _2.- نحن لسنا مسؤولين عن الجهل و/أو عدم المعرفة بالموضوع_
 _3.- الروبوت غير نشط 24 ساعة في اليوم ما لم يقرر المالك خلاف ذلك_
 _4.- "الشركة" ليست مسؤولة عن استخدام الروبوت الفرعي أو الروبوت غير الرسمي، حيث أنهم أشخاص (أطراف ثالثة) وليس لدينا أي سيطرة عليهم_
 _5.- نحن لسنا مسؤولين عن الأرقام التي قد يتم إرسالها لدعم استخدام البوت، ويُنصح دائمًا باستخدام الأرقام الافتراضية لاستخدامات البوت_
 _6.- التسجيلات الصوتية/الملاحظات الصوتية/الصور/مقاطع الفيديو أو أي ملفات وسائط متعددة أخرى مملوكة لـ chahid bot هي ملك لهذا الروبوت فقط وحصريًا، إذا تم اكتشاف روبوت آخر مع واحد أو بعض ملفات الوسائط المتعددة المذكورة سابقًا، سيتم اتخاذ الإجراءات اللازمة في هذا الشأن.
*➤ رسالة رقم البوت؟*
_- إذا وصلتك في أي وقت رسالة من رقم البوت وهي ليست أمر، فمن المحتمل أن تكون من صاحب البوت أو صاحب الرقم، فهذا شخص حقيقي لذا نطلب منك عدم التقليل من احترامه._


*⁉️ هل لديك أي شكوك؟*
_- إذا كان لا يزال لديك أي أسئلة أو شكاوى حول ما هو مذكور هنا أو فيما يتعلق بالبوت، فاتصل بي على رقمي الشخصي وسأقوم بالرد عليه في أقرب وقت ممكن لتزويدك بالحل و/أو تحمل مسؤولية أي شكاوى._ 

> wa.me/212679556171
> chahid 
> Gmail: simochahid100@gmail.com

*∆ mohammed chahid  ∆*`;
