const handler = async (m, {conn}) => {
  m.reply(global.ter);
};
handler.customPrefix = /my/i;
handler.command = new RegExp;
export default handler;

global.ter = `
📮 العشر الماحيات .. للذنوب والخطايا والسيئات ❗
        
🔖 ١ - امحها بتسبيحك
⭕ _قال رسول الله صلى الله عليه وسلم : " من قال: سبحان الله وبحمده في يوم مائة مرة ، حُطت خطاياه ولو كانت مثل زبد البحر 
📚صحيح مسلم ٢٦٩١ 

🔖 ٢ - امحها باستغفارك
⭕ _ قال رسول الله صلى الله عليه وسلم :" من قال : 
أستغفر الله ، الذي لا إله إلا هو ، الحي القيوم ، وأتوب إليه 
غفر له وإن كان فر من الزحف 
📚 الألباني مشكاة المصابيح ٢٣٥٣ 

🔖 ٣ - امحها بهذا الذكر
⭕ _ قال رسول الله صلى الله عليه وسلم : " ما على الأرض
أحد يقول : لا إله إلا الله ، والله أكبر ، ولا حول ولا قوة إلا بالله 
إلا كفرت عنه خطاياه ، ولو كانت مثل زبد البحر 
📚 الألباني في  صحيح الجامع ٥٦٣٦ 

🔖 ٤ - امحها بعد طعامك
⭕_ قال رسول الله صلى الله عليه وسلم : " من أكل طعاماً
ثم قال : الحمد لله الذي أطعمني هذا الطعام ، ورزقنيه 
من غير حول مني ولا قوة غفر له ما تقدم من ذنبه .
📚 الألباني في صحيح الجامع ٦٠٨٦ 

🔖 ٥ - امحها بعد لباسك
⭕_ قال رسول الله صلى الله عليه وسلم :" ومن لبس ثوباً فقال : الحمد لله الذي كساني هذا ، ورزقنيه من غير حول
مني ولا قوة غفر له ما تقدم من ذنبه .
📚الألباني في صحيح الجامع ٦٠٨٦ 

🔖 ٦ - امحها حين الأذان
⭕ _ قال رسول الله صلى الله عليه وسلم :" من قال 
حين يسمع المؤذن : أشهد أن لا إله إلا الله، وحده لا شريك له 
وأن محمدا عبده ورسوله ، رضيت بالله ربا، وبمحمد رسولا
وبالإسلام دينا ؛ غفر له ذنبه 
📚صحيح مسلم ٣٨٦ 

🔖 ٧ - امحها عند الوضوء
⭕ _ قال رسول الله صلى الله عليه وسلم : " من توضأ فأحسن الوضوء، خرجت خطاياه من جسده حتى تخرج من تحت أظفاره " 
📚 صحيح مسلم ٢٤٥ 

🔖 ٨ - امحها بعد صلاتك
⭕_ قال رسول الله صلى الله عليه وسلم : " من سبح الله 
في دبر كل صلاة ثلاثا وثلاثين ، وحمد الله ثلاثا وثلاثين 
وكبر الله ثلاثا وثلاثين ، فتلك تسعة وتسعون ، وقال تمام المائة
لا إله إلا الله ، وحده لا شريك له ، له الملك ، وله الحمد وهو
على كل شيء قدير غفرت خطاياه وإن كانت مثل زبد البحر .
📚صحيح مسلم ٥٩٧ 

🔖 ٩ - امحها قبل نومك
⭕_ قال رسول الله صلى الله عليه وسلم : " من قال حين يأوي إلى فراشه : لا إله إلا الله وحده لا شريك له ، له الملك 
و له الحمد ، وهو على كل شيء قدير ، لاحول ولا قوة إلا بالله العلى العظيم ، سبحان الله ، والحمد لله ، ولا إله إلا الله 
والله أكبر ؛ غفرت له
ذنوبه أوخطاياه وإن كانت مثل زبد البحر " 
📚 الالباني في صحيح الترغيب  ٦٠٧ 

🔖 ١٠ - امحها إذا قمت من نومك
⭕ _قال رسول الله صلى الله عليه وسلم : " من تعار من الليل، فقال: لا إله إلا الله وحده لا شريك له، له الملك وله الحمد، وهو على كل شيء قدير، الحمد لله، وسبحان الله
ولا إله إلا الله، والله أكبر، ولا حول ولا قوة إلا بالله ، ثم قال : اللهم اغفر لي، أو دعا، استجيب له، فإن توضأ وصلى 
قبلت صلاته 
📚صحيح البخاري ١١٥٤
`;
